{
  "name": "Bosna i Hercegovina",
  "capital": "Sarajevo",
  "population": "3.531.159",
  "area": "51.209,2 km²",
  "basicInfo": "Bosna i Hercegovina se sastoji od dva entiteta: Federacije Bosne i Hercegovine i Republike Srpske, dok Brčko Distrikt ima poseban status.\n\nTri najbrojnija naroda su Bošnjaci, Srbi i Hrvati.\n\nVišečlani naziv Bosna i Hercegovina potiče od naziva dviju geografskih oblasti (oblast Bosna i oblast Hercegovina)\n\nEntitet Republika Srpska upotrebljava posebnu zastavu i grb, dok entitet Federacija Bosne i Hercegovine i Distrikt Brčko koriste službenu zastavu i grb Bosne i Hercegovine.",
  "history": "Prema širem konsenzusu prvi sačuvani pomen Bosne nalazi se u 'De administrando imperio' napisanom sredinom X vijeka, koji Bosnu opisuje kao malu zemlju koju nastanjuju Srbi. Bosna je tada bila zasebna zemlja u okviru srpske države, čiji su je drugi dijelovi okruživali sa svih strana.\n\nBanovina Bosna predstavlja drugi period u razvoju srpske feudalne države Bosne. Formirana je verovatno već 1137. godine kada vrhovnu vlast nad Bosnom preuzima kraljevina Mađarska i pretvara je u jednu od svojih banovina (poput Hrvatske 1102) i na njenom čelu se od tada umesto kneza nalazi ban. Postojala je do Mitrovdana (26. oktobra) 1377. godine kada se njen poslednji ban Tvrtko I (ban 1353—1377, kralj 1377—1391) na grobu Svetog Save u manastiru Mileševa ovenčao za kralja uzdigavši Bosnu na rang kraljevine.\n\nOsmansko osvajanje Bosne obuhvata osvajanja tokom maja i juna 1463. godine koja su se okončala predajom Ključa i pogubljenjem poslednjeg kralja Bosne Stefana Tomaševića (kralj Bosne 10.07.1461-jun 1463) u Jajcu krajem juna.\n\nAustrougarsko osvajanje Bosne i Hercegovine je izvršeno u razdoblju od 29. jula do 20. oktobra 1878. godine, na osnovu odluke Berlinskog kongresa. Tokom vojnih dejstava, austrougarske snage su u pojedinim oblastima Bosne i Hercegovine naišle na otpor lokalnih jedinica, sastavljenih prvenstveno od muslimanskih vojnika, koji su se protivili austrougarskom zaposedanju zemlje. Usled vojne nadmoćnosti austrougarskih snaga, otpor je domaćih snaga je bio savladan, nakon čega je austrougarska vojska zaposela celokupnu teritoriju koja je prema odredbama Berlinskog ugovara bila dodeljena na upravu Austrougarskoj monarhiji.\n\n5. oktobra 1908. Austrougarska je objavila aneksiju Bosne i Hercegovine. 28. juna 1914. Gavrilo Princip, član organizacije Mlada Bosna, je u Sarajevu ubio prijestolonasljednika austrougarskog trona, nadvojvodu Franca Ferdinanda, i smrtno ranio njegovu suprugu Sofiju, za što se kasnije ispostavilo da je događaj koji je poslužio kao povod za izbijanje Prvog svjetskog rata.\n\nNakon austrougarskog poraza u ratu, Vijeće narodnih prvaka i poslanika — 28. novembra 1918. godine — donijelo je odluku o ujedinjenju Bosne i Hercegovine sa Kraljevinom Srbijom, koja je prerasla u Kraljevinu Srba, Hrvata i Slovenaca.\n\nNakon okupacije Jugoslavije u Drugom svjetskom ratu, cjelokupna teritorija Bosne i Hercegovine pripala je Nezavisnoj Državi Hrvatskoj.\n\nKrajem novembra 1943. godine, Antifašističko vijeće narodnog oslobođenja Jugoslavije održalo je zasjedanje u Jajcu, na kojem je odlučeno da se nova Jugoslavija uspostavi kao federacija sa šest republika, od kojih bi jedna bila i Bosna i Hercegovina u svojim granicama iz perioda austrougarske okupacije. Ustav Federativne Narodne Republike Jugoslavije iz 1946. godine ozvaničio je ovu odluku.\n\nRaspadom SFRJ otpočeli su oružani sukobi na teritoriji Savezne Republike Bosne i Hercegovine. Rat na teritoriji Bosne i Hercegovine trajao je od 6. aprila 1992. do 14. decembra 1995. godine. Dejtonski mirovni sporazum je parafiran 21. novembra 1995 u gradu Dejtonu u Sjedinjenim Američkim Državama, a konačna verzija potpisana je u Parizu 14. decembra 1995. godine. Ovaj sporazum označio je osnivanje države Bosne i Hercegovine.",
  "flagUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bf/Flag_of_Bosnia_and_Herzegovina.svg/1920px-Flag_of_Bosnia_and_Herzegovina.svg.png",
  "coatOfArmsUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Coat_of_arms_of_Bosnia_and_Herzegovina.svg/800px-Coat_of_arms_of_Bosnia_and_Herzegovina.svg.png",
  "countryImageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/Map_Bih_entities_cyr.png/1024px-Map_Bih_entities_cyr.png",
  "serbRepublicFlagUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/Flag_of_the_Republika_Srpska.svg/1920px-Flag_of_the_Republika_Srpska.svg.png",
  "serbRepublicCoatOfArmsUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Seal_of_the_Republika_Srpska.svg/1024px-Seal_of_the_Republika_Srpska.svg.png"
}